using Microsoft.EntityFrameworkCore;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using TopNewsApi.Core.Entities.Site;

namespace TopNewsApi.Infrastructure.Initializers
{
    internal static class PostsAndCategoriesInitializers
    {
        public static void SeedCategories(this ModelBuilder modelBuilder)
        {
            modelBuilder.Entity<Category>().HasData(
                new Category { Id = 1, Name = "Політика" },
                new Category { Id = 2, Name = "Технології" },
                new Category { Id = 3, Name = "Наука" }
            );
        }
        public static void SeedPosts(this ModelBuilder modelBuilder)
        {
            modelBuilder.Entity<Post>().HasData(
                new Post
                {
                    Id = 1,
                    Title = "Вибори до місцевої ради",
                    Description = "Завтра у місті відбудуться вибори до місцевої ради. Громадяни вибиратимуть новий склад місцевих представників.",
                    FullText = "У понеділок, 15 серпня, у місті відбудуться вибори до місцевої ради. Це важливий подія для місцевої громади, оскільки громадяни визначатимуть склад обласних представників на наступні чотири роки. Кілька партій висунули своїх кандидатів, і змагання обіцяють бути напруженими. Громадяни закликаються взяти активну участь у голосуванні та виборах.",
                    PublishDate = "00.00.0000",
                    CategoryId = 1,
                    ImagePath = "election.jpg"
                },
                new Post
                {
                    Id = 2,
                    Title = "Міжнародна дипломатія",
                    Description = "Президенти двох країн підписали угоду про співпрацю в галузі торгівлі та культурних відносин.",
                    FullText = "У вівторок, 25 липня, президенти країн Альфа та Бета підписали важливу двосторонню угоду про розширення співпраці. Згідно з угодою, країни зобов'язалися сприяти розвитку торгівлі між собою, а також спільно реалізовувати культурні проекти та обмін досвідом у галузі освіти. Це крок до зміцнення міжнародних відносин та покращення економічних зв'язків між країнами.",
                    PublishDate = "00.00.0000",
                    CategoryId = 1,
                    ImagePath = "diplomacy.jpg"
                },
                new Post
                {
                    Id = 3,
                    Title = "Випуск нового смартфона X-Phone",
                    Description = "Технологічна компанія X-Tech анонсувала випуск свого нового флагманського смартфона X-Phone з інноваційними функціями.",
                    FullText = " X-Tech, відомий гравець на ринку технологій, оголосив про випуск свого нового смартфона, який отримав назву X-Phone. Цей пристрій вражає своїми характеристиками: потужний процесор, вдосконалена камера зі здатністю запису відео в 8K, а також підтримка нових стандартів зв'язку. X-Phone також став першим смартфоном компанії, який використовує технологію розпізнавання обличчя для максимальної безпеки користувачів.",
                    PublishDate = "00.00.0000",
                    CategoryId = 2,
                    ImagePath = "x-phone.jpg"
                },
                new Post
                {
                    Id = 4,
                    Title = "Прор DurchCloud - Прорив у хмарних технологіях",
                    Description = "Компанія DurchTech представила свій новий продукт - DurchCloud, який обіцяє революціонізувати підхід до зберігання даних у хмарі.",
                    FullText = "DurchTech, інноваційна компанія в галузі хмарних технологій, впровадила свій останній досягнення - DurchCloud. Ця платформа надає користувачам можливість зберігати, обробляти та забезпечувати безпеку своїх даних у хмарному середовищі з використанням передових алгоритмів шифрування. Прор DurchCloud обіцяє високу продуктивність, зручний інтерфейс та гарантовану конфіденційність інформації користувачів.",
                    PublishDate = "00.00.0000",
                    CategoryId = 2,
                    ImagePath = "durchcloud.jpg"
                },
                new Post
                {
                    Id = 5,
                    Title = "Відкриття нової планети у галактиці Андромеда",
                    Description = "Астрономи оголосили про відкриття нової планети, схожої на Землю, у галактиці Андромеда за допомогою потужного телескопа.",
                    FullText = "За допомогою найсучасніших телескопів, астрономи виявили нову планету, яка знаходиться у галактиці Андромеда, що знаходиться на відстані понад 2 мільйонів світлових років від Землі. Хоча планета має відмінності, вчені вбачають у ній потенційне місце для досліджень з пошуку позаземного життя через подібність умов до наших. Це відкриття може революціонізувати наше розуміння Всесвіту та можливості існування інших цивілізацій.",
                    PublishDate = "00.00.0000",
                    CategoryId = 3,
                    ImagePath = "andromeda_planet.jpg"
                },
                new Post
                {
                    Id = 6,
                    Title = "Новий метод боротьби зі загостреннями алергій",
                    Description = "Вчені розробили і випробували новий метод лікування алергійних реакцій, який дозволяє зменшити загострення та покращити якість життя хворих.",
                    FullText = "Дослідники з медичного інституту представили новий метод, який спрямований на боротьбу зі загостреннями алергій. Цей метод базується на використанні імунотерапії та принципу поступового звикання організму до алергенів. Після успішних клінічних випробувань, пацієнти, які страждають від сильних алергійних реакцій, зазнали помітного покращення стану здоров'я та зменшення інтенсивності алергічних симптомів.",
                    PublishDate = "00.00.0000",
                    CategoryId = 3,
                    ImagePath = "allergy_treatment.jpg"
                }
            );
        }
    }
}
